src/test/resources/pi_XI/message4.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
		xmlns:xi="http://sap.com/xi/XI/Message/30" xmlns:xlink="http://www.w3.org/1999/xlink">
		<xi:Main soap:mustUnderstand="1" versionMajor="3" versionMinor="1">
			<xi:MessageClass>ApplicationResponse</xi:MessageClass>
			<xi:ProcessingMode>synchronous</xi:ProcessingMode>
			<xi:MessageId>4c387c60-4299-43e6-9e49-7a66b8aacf70</xi:MessageId>
			<xi:RefToMessageId>00000000-0000-0000-0000-000000000033</xi:RefToMessageId>
			<xi:TimeSent>2023-04-21T19:42:15.050Z</xi:TimeSent>
			<xi:Sender>
				<xi:Party agency="http://sap.com/xi/XI" scheme="XIParty"/>
				<xi:Service>DefaultXIService</xi:Service>
			</xi:Sender>
			<xi:Receiver>
				<xi:Party agency="http://sap.com/xi/XI" scheme="XIParty"/>
				<xi:Service>TEST</xi:Service>
			</xi:Receiver>
			<xi:Interface namespace="urn:vendor:po:I:ERP-SD:Reports:Report">SI_RequestReport_InAsync</xi:Interface>
		</xi:Main>
		<xi:ReliableMessaging ApplicationAckRequested="false" ApplicationErrorAckRequested="false"
			SystemAckRequested="false" SystemErrorAckRequested="false" soap:mustUnderstand="1">
			<xi:QualityOfService>BestEffort</xi:QualityOfService>
		</xi:ReliableMessaging>
	</soap:Header>
	<soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
		xmlns:xi="http://sap.com/xi/XI/Message/30" xmlns:xlink="http://www.w3.org/1999/xlink">
		<xi:Manifest>
			<xi:Payload xlink:href="cid:6e9b3c8f-5140-49d4-a95e-48963e420680-104@cxf.apache.org">
				<xi:Name>MainDocument</xi:Name>
				<xi:Description>unspecified document</xi:Description>
				<xi:Type>Application</xi:Type>
			</xi:Payload>
		</xi:Manifest>
	</soap:Body>
</soap:Envelope>
